# Academy-Top-C-sharp

#### Решения домашних заданий C#

## Homework 01

### Тема: "Введение в C# и платформу .NET"

**Задание:** Напишите программу, которая выводит на экран рецепт вашего любимого простого блюда или напитка (например, бутерброда, чая, салата). Программа должна последовательно отобразить:
- Название блюда/напитка.
- Заголовок "Ингредиенты:".
- Список ингредиентов (каждый на новой строке).
- Заголовок "Приготовление:".
- Краткую последовательность шагов приготовления (каждый на новой строке).

**Требования к выполнению:**
- Приложение должно быть создано на основе шаблона "Консольное приложение"
- После вывода всей информации программа должна ожидать нажатия клавиши Enter от пользователя
- В исходном коде должен присутствовать как минимум один комментарий, поясняющий любую часть вашей программы (например, описывающий назначение блока кода или конкретной строки)

## Homework 02

### Тема: "Переменные, базовые типы данных"

**Задание:** Напишите программу, которая вычисляет Индекс Массы Тела (ИМТ). Программа должна последовательно запросить у пользователя:
- Вес в килограммах (например, 75.5).
- Рост в метрах (например, 1.82).

После получения данных программа должна рассчитать ИМТ по формуле и вывести результат на экран.    
Формула для расчета ИМТ: ИМТ = Вес (в кг) / (Рост (в м) * Рост (в м))

**Требования к выполнению:**
- Приложение должно быть создано на основе шаблона "Консольное приложение"
- Результат должен быть выведен в понятном для пользователя виде с использованием интерполяции строк (через $"").
- В исходном коде должен присутствовать как минимум один осмысленный комментарий.

## Homework 03

### Тема: "Условные конструкции и ветвление логики"

**Задание:** Напишите программу "Улучшенный калькулятор", которая запрашивает у пользователя два числа и символ арифметической операции, а затем выводит результат этой операции.

Логика работы программы:
- Программа запрашивает у пользователя первое число.
- Программа запрашивает у пользователя второе число.
- Программа просит пользователя ввести символ одной из четырех операций: +, -, *, /.
- В зависимости от введенного символа программа выполняет соответствующую операцию над числами.
- Программа выводит результат на экран.
- Особые случаи:
  - Программа должна корректно обрабатывать попытку деления на ноль, выводя соответствующее сообщение об ошибке.
  - Если пользователь вводит неверный символ операции (любой, кроме +, -, *, /), программа должна сообщить об этом.

**Требования к выполнению:**
- Приложение должно быть создано на основе шаблона "Консольное приложение"
- Для выбора операции используйте конструкцию switch (рекомендуется) или лестницу if, else if, else.
- Результат должен быть выведен в понятном для пользователя виде с использованием интерполяции строк.

## Homework 04

### Тема: "Циклы. Повторяющиеся действия"

**Задание:** Модифицировать игру "Угадай число" из практической работы, добавив в нее следующие улучшения:
- Ограниченное количество попыток: У пользователя должно быть ограниченное количество попыток (например, 7) чтобы угадать число.
- Два исхода игры:
  - Если пользователь угадывает число за отведенное количество попыток, он выигрывает.
  - Если попытки заканчиваются, а число не угадано, пользователь проигрывает, и программа должна сообщить, какое число было загадано.
- Возможность сыграть снова: после окончания каждой партии (неважно, победа или поражение) программа должна спрашивать у пользователя, хочет ли он сыграть еще раз. Если пользователь вводит "да" (или "yes"), игра должна начаться заново с новым загаданным числом. Если он вводит что-либо другое, программа должна завершиться.

**Требования к выполнению:**
- Для основного игрового цикла (который позволяет играть снова и снова) используйте цикл do-while.
- Обязательно используйте класс Random для генерации нового числа в начале каждой новой игры.
- В конце, после отказа пользователя играть снова, программа должна ожидать нажатия клавиши Enter перед завершением.

## Homework 05

### Тема: "Методы. Организация кода"

**Задание:** Вспомните программу *Улучшенный калькулятор*, которую вы писали в домашнем задании к уроку 3. Весь ее код, скорее всего, был написан в одном месте (внутри метода Main или на верхнем уровне).

Ваша задача — выполнить **рефакторинг** этой программы, разбив ее на логические, переиспользуемые методы. Основная функциональность калькулятора должна остаться прежней, но его внутренняя структура должна кардинально измениться.

**Требования к выполнению:**
- Программа должна быть написана с использованием **классической структуры**.
- **Метод Main** должен быть **чистым**: он не должен содержать сложной логики, а в основном состоять из вызовов других, вспомогательных методов. Он играет роль дирижера программы.
- Вы должны создать и использовать как **минимум три** вспомогательных метода.

Внешнее поведение программы не должно измениться. Результат взаимодействия с пользователем должен остаться таким же, как и в домашнем задании к уроку 3.

## Homework 06

### Тема: "Массивы. Хранение коллекций данных"

**Задание:** Написать программу, которая "переворачивает" массив. Программа должна создать массив с заранее определенными значениями, а затем создать второй массив, который будет содержать те же элементы, но в обратном порядке.

**Логика работы:**
1. В методе Main создается исходный массив с заранее определенными значениями (например, *int[] originalArray = { 10, 20, 30, 40, 50 }*;).
2. Программа выводит исходный массив на экран в одну строку.
3. Программа создает новый массив такого же размера, что и исходный.
4. С помощью **цикла for** программа заполняет новый массив элементами из исходного, но в обратном порядке. (Подсказка: вам понадобятся два счетчика или одна хитрая формула для вычисления индексов).
5. Программа выводит перевернутый массив на экран, также в одну строку.

**Требования к выполнению:**
- Программа должна быть написана с использованием **классической структуры**.
- Для вывода массивов на экран используйте циклы (for или foreach) и Console.Write(), чтобы элементы выводились в одну строку через пробел.
- Для заполнения перевернутого массива используйте цикл for, так как вам потребуется работать с индексами обоих массивов.

## Homework 07

### Тема: "Введение в классы и объекты. Создание собственных типов"

**Задание:** Создайте программу для работы с геометрической фигурой "Прямоугольник". Для этого вам необходимо спроектировать и реализовать **класс Rectangle**.

**Требования к выполнению:**
- Добавьте поля: внутри класса Rectangle должны быть два публичных (public) поля:
  - double width (ширина)
  - double height (высота)
- Добавьте методы: Внутри класса Rectangle должны быть два публичных метода, которые возвращают результат:
  - double GetArea(): этот метод должен вычислять площадь прямоугольника (ширина * высота) и возвращать результат.
  - double GetPerimeter(): этот метод должен вычислять периметр прямоугольника (2 * (ширина + высота)) и возвращать результат.
- Используйте класс в Main: Внутри метода Main выполните следующие действия:
  - Создайте как минимум два разных объекта (экземпляра) класса Rectangle.
  - Задайте значения для полей width и height каждого объекта.
  - Для каждого объекта вызовите методы GetArea() и GetPerimeter().
  - Сохраните возвращенные значения в переменные.
  - Выведите на экран информацию о каждом прямоугольнике, включая его размеры, площадь и периметр.

 
